
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Попытка
		// регистр КадровыеПеремещения
		Движения.КадровыеПеремещения.Записывать = Истина;
		Движение = Движения.КадровыеПеремещения.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.Должность = Должность;
		Движение.Оклад = Оклад;
		Движение.Действие = Перечисления.КадровыеДействия.Перевод;
		
		// Обновление информации сотрудника в справочнике Сотрудники
		ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
		
		ОбъектСотрудник.Подразделение = Подразделение;
		ОбъектСотрудник.Должность = Должность;
		ОбъектСотрудник.Оклад = Оклад;
		ОбъектСотрудник.Записать();
	Исключение
		Сообщить("Ошибка при обновлении сотрудника! Обновите информацию вручную.");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры






