
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// проверка корректности даты  и прав
	Если НачалоДня(Дата) <> НачалоДня(ТекущаяДата()) И Не РольДоступна("Администратор") Тогда
		Сообщить("Документы должны проводиться текущией датой! Для проведения обратитесь к администратору.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// регистр КадровыеПеремещения
	Движения.КадровыеПеремещения.Записывать = Истина;
	Движение = Движения.КадровыеПеремещения.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Действие = Перечисления.КадровыеДействия.Увольнение;

	Попытка
		// Обновление информации сотрудника в справочнике Сотрудники
		ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
		ОбъектСотрудник.Уволен = Истина;
		ОбъектСотрудник.Записать();
	Исключение
		Сообщить("Ошибка при обновлении сотрудника! Обновите информацию вручную.");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// проверка даты и прав
	Если НачалоДня(Дата) <> НачалоДня(ТекущаяДата()) И Не РольДоступна("Администратор") Тогда
		Сообщить("Запрещено снимать проведение документов за прошедший период! Обратитесь к администратору.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	Попытка
		// Обновление информации сотрудника в справочнике Сотрудники
		ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
		ОбъектСотрудник.Уволен = Ложь;
		ОбъектСотрудник.Записать();
	Исключение
		Сообщить("Ошибка при обновлении сотрудника! Обновите информацию вручную.");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры




