
&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	// проверяем сотрудника
	Если Не СотрудникДоступенДляУвольнения(Объект.Сотрудник) Тогда
		Сообщить("Сотрудник """ + Объект.Сотрудник + """ уже в уволен или не в штате!");
		Объект.Сотрудник = Неопределено;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция СотрудникДоступенДляУвольнения(СотрудникСсылка)
	
	Возврат СотрудникВШтате(СотрудникСсылка);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если документ не новый
	Если Не Объект.Ссылка.Пустая() Тогда
		// проверка прав на редактирование
		Если НачалоДня(Объект.Дата) < НачалоДня(ТекущаяДата()) И Не РольДоступна("Администратор") Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
			Сообщить("Запрещено редактировать проведённые документы за прошедшую дату! Обратитесь к администратору.");
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры
