
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если СотрудникВШтатеНаСервере(Объект.Сотрудник) Тогда
			
			Сообщить("Сотрудник """ + Объект.Сотрудник + """ уже в штате!");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция СотрудникВШтатеНаСервере(Сотрудник)
	
	Возврат СотрудникВШтате(Сотрудник);
	    
КонецФункции

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ДанныеСотрудника =  ПолучитьДанныеСотрудникаССервераПоСсылке(Объект.Сотрудник);
	
	Если ДанныеСотрудника = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Объект.Подразделение = ДанныеСотрудника.Подразделение;
	Объект.Должность = ДанныеСотрудника.Должность;
	Объект.Оклад = ДанныеСотрудника.Оклад;
	Объект.Дата = ДанныеСотрудника.ДатаДокумента;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСотрудникаССервераПоСсылке(СотрудникСсылка)
	
	Возврат ПолучитьДанныеСотрудникаПоСсылке(СотрудникСсылка);
	
КонецФункции