&НаКлиенте
Процедура ДатаПриёмаПриИзменении(Элемент)
	
	Если Объект.ДатаПриёма > ТекущаяДата() Тогда
		
		Сообщить("Дата приема не может быть в будущем!");
		Объект.ДатаПриёма = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПустаяСтрока(Объект.Наименование) Тогда
		
		Отказ = Истина;
		Сообщить("ФИО сотрудника не может быть пустым!");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если СотрудникСуществуетНаСервере(Объект.Наименование) Тогда
			Ответ = Вопрос("Сотрудник """ + Объект.Наименование + """ уже существует! Добавить?", РежимДиалогаВопрос.ДаНет);
			
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				
				Отказ = Истина;
				Сообщить("Сотрудник """ + Объект.Наименование + """ не добавлен!");
				Возврат;
				
			КонецЕсли;
			
			Сообщить("Сотрудник """ + Объект.Наименование + """ добавлен!")
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СотрудникСуществуетНаСервере(Сотрудник)	
	
	Возврат СотрудникСуществует(Сотрудник)
	
КонецФункции

&НаКлиенте
Процедура ПолучитьОтчётПоСотруднику(Команда)
	
	  Отчёт = ПолучитьОтчётПоСотрудникуССервера();
	  
	  Если Отчёт = Неопределено Тогда
		  
		  Сообщить("Ошибка создания отчёта по сотруднику """ + Объект.Наименование + """");
		  
		  Возврат;
		  
	  КонецЕсли;
	  
	  Отчёт.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтчётПоСотрудникуССервера()
	
	  Возврат ПолучитьИсториюСотрудника(Объект.Ссылка);
	  	
КонецФункции
